#### ✅ Terraform Plan — `success`

<details><summary>Show plan output</summary>

```
aws_kms_key.pii: Refreshing state... [id=2c0b52db-06ee-4f93-bdba-3d7a7350579a]
aws_kms_key.footer: Refreshing state... [id=a07d5754-a10d-4201-ac74-54a6de4648db]
aws_kms_key.pci: Refreshing state... [id=93a12646-8f67-41ab-a258-c48548b29b39]
aws_iam_role.write_role: Refreshing state... [id=pwe-hackathon-write-role]
aws_iam_role.fraud_analyst: Refreshing state... [id=pwe-hackathon-fraud-analyst]
aws_iam_role.junior_analyst: Refreshing state... [id=pwe-hackathon-junior-analyst]
aws_iam_role.athena_spark_execution: Refreshing state... [id=pwe-hackathon-athena-spark-execution]
aws_s3_bucket.data: Refreshing state... [id=pwe-hackathon-pme-data-651767347247]
aws_iam_role.marketing_analyst: Refreshing state... [id=pwe-hackathon-marketing-analyst]
aws_kms_alias.footer: Refreshing state... [id=alias/pwe-hackathon-footer-key]
aws_kms_alias.pii: Refreshing state... [id=alias/pwe-hackathon-pii-key]
aws_kms_alias.pci: Refreshing state... [id=alias/pwe-hackathon-pci-key]
aws_iam_role_policy.fraud_analyst_kms: Refreshing state... [id=pwe-hackathon-fraud-analyst:kms-decrypt-all]
aws_iam_role_policy.write_role_kms: Refreshing state... [id=pwe-hackathon-write-role:kms-encrypt-all]
aws_iam_role_policy.junior_analyst_kms: Refreshing state... [id=pwe-hackathon-junior-analyst:kms-decrypt-footer]
aws_iam_role_policy.marketing_analyst_kms: Refreshing state... [id=pwe-hackathon-marketing-analyst:kms-decrypt-footer-pii]
aws_iam_role_policy.athena_spark_athena: Refreshing state... [id=pwe-hackathon-athena-spark-execution:athena-access]
aws_iam_role_policy.athena_spark_cloudwatch: Refreshing state... [id=pwe-hackathon-athena-spark-execution:cloudwatch-logs]
aws_iam_role_policy.athena_spark_glue: Refreshing state... [id=pwe-hackathon-athena-spark-execution:glue-catalog]
aws_s3_bucket_versioning.data: Refreshing state... [id=pwe-hackathon-pme-data-651767347247]
aws_s3_bucket_server_side_encryption_configuration.data: Refreshing state... [id=pwe-hackathon-pme-data-651767347247]
aws_iam_role_policy.fraud_analyst_s3: Refreshing state... [id=pwe-hackathon-fraud-analyst:s3-read]
aws_athena_workgroup.junior: Refreshing state... [id=pwe-hackathon-pme-junior]
aws_athena_workgroup.marketing: Refreshing state... [id=pwe-hackathon-pme-marketing]
aws_iam_role_policy.write_role_s3: Refreshing state... [id=pwe-hackathon-write-role:s3-read-write]
aws_iam_role_policy.athena_spark_s3: Refreshing state... [id=pwe-hackathon-athena-spark-execution:s3-data-and-results]
aws_s3_bucket_public_access_block.data: Refreshing state... [id=pwe-hackathon-pme-data-651767347247]
aws_iam_role_policy.marketing_analyst_s3: Refreshing state... [id=pwe-hackathon-marketing-analyst:s3-read]
aws_athena_workgroup.fraud: Refreshing state... [id=pwe-hackathon-pme-fraud]
aws_iam_role_policy.junior_analyst_s3: Refreshing state... [id=pwe-hackathon-junior-analyst:s3-read]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.pme_lambda will be created
  + resource "aws_cloudwatch_log_group" "pme_lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/pwe-hackathon-pme-encrypt"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags_all          = {
          + "ManagedBy" = "terraform"
          + "Project"   = "pwe-hackathon"
        }
    }

  # aws_ecr_lifecycle_policy.pme_lambda will be created
  + resource "aws_ecr_lifecycle_policy" "pme_lambda" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 5 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 5
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "pwe-hackathon-pme-lambda"
    }

  # aws_ecr_repository.pme_lambda will be created
  + resource "aws_ecr_repository" "pme_lambda" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "pwe-hackathon-pme-lambda"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "ManagedBy" = "terraform"
          + "Project"   = "pwe-hackathon"
        }
    }

  # aws_iam_role.lambda_pme_encrypt will be created
  + resource "aws_iam_role" "lambda_pme_encrypt" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "pwe-hackathon-lambda-pme-encrypt"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "ManagedBy" = "terraform"
          + "Project"   = "pwe-hackathon"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy.lambda_pme_kms will be created
  + resource "aws_iam_role_policy" "lambda_pme_kms" {
      + id          = (known after apply)
      + name        = "kms-encrypt-all"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "kms:Encrypt",
                          + "kms:Decrypt",
                          + "kms:DescribeKey",
                          + "kms:GenerateDataKey",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:kms:us-east-2:651767347247:key/a07d5754-a10d-4201-ac74-54a6de4648db",
                          + "arn:aws:kms:us-east-2:651767347247:key/93a12646-8f67-41ab-a258-c48548b29b39",
                          + "arn:aws:kms:us-east-2:651767347247:key/2c0b52db-06ee-4f93-bdba-3d7a7350579a",
                        ]
                      + Sid      = "KMSEncryptAllPMEKeys"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.lambda_pme_logs will be created
  + resource "aws_iam_role_policy" "lambda_pme_logs" {
      + id          = (known after apply)
      + name        = "cloudwatch-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy.lambda_pme_s3 will be created
  + resource "aws_iam_role_policy" "lambda_pme_s3" {
      + id          = (known after apply)
      + name        = "s3-read-write"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:PutObject",
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::pwe-hackathon-pme-data-651767347247",
                          + "arn:aws:s3:::pwe-hackathon-pme-data-651767347247/*",
                        ]
                      + Sid      = "S3ReadWriteData"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_lambda_function.pme_encrypt will be created
  + resource "aws_lambda_function" "pme_encrypt" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "pwe-hackathon-pme-encrypt"
      + id                             = (known after apply)
      + image_uri                      = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1536
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "ManagedBy" = "terraform"
          + "Project"   = "pwe-hackathon"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "FOOTER_KEY_ARN" = "arn:aws:kms:us-east-2:651767347247:alias/pwe-hackathon-footer-key"
              + "PCI_KEY_ARN"    = "arn:aws:kms:us-east-2:651767347247:alias/pwe-hackathon-pci-key"
              + "PII_KEY_ARN"    = "arn:aws:kms:us-east-2:651767347247:alias/pwe-hackathon-pii-key"
              + "S3_BUCKET"      = "pwe-hackathon-pme-data-651767347247"
              + "S3_PREFIX"      = "pme-data"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config {
          + log_format = "Text"
          + log_group  = "/aws/lambda/pwe-hackathon-pme-encrypt"
        }

      + tracing_config (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ecr_repository_url              = (known after apply)
  + lambda_execution_role_arn       = (known after apply)
  + lambda_function_arn             = (known after apply)
  + lambda_function_name            = "pwe-hackathon-pme-encrypt"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pushed by @SiweiMa, Action: `pull_request`*